АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруПропарки/алк_ЗагрузкаВКамеруПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеруПропарки</name>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапускаКамеры</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдётЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияПропарки</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативноеВремяПропарки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПериодыСезоновПропарки/алк_ПериодыСезоновПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПериодыСезоновПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </resources>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиВКамерахПропарки/алк_ОстаткиВКамерахПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиВКамерахПропарки</name>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_СезоныПропарки/алк_СезоныПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СезоныПропарки</name>
  <enumValues>
    <name>Лето</name>
  </enumValues>
  <enumValues>
    <name>Зима</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруПропарки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
		
		ЭтотОбъект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000034");  //Участок ГТО
		
		ЭтотОбъект.Дата 			= НачалоМинуты(ТекущаяДата());
		ЭтотОбъект.НачалоЗагрузки 	= ЭтотОбъект.Дата;
		ЭтотОбъект.Сезон 			= ПолучитьСезон(ЭтотОбъект.Дата);
	    		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);

КонецПроцедуры

Функция ПолучитьСезон(ДатаСреза)
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДата();	
	КонецЕсли; 

	Сезон = Перечисления.алк_СезоныПропарки.Лето;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сезон = ВыборкаДетальныеЗаписи.Сезон;
	КонецЦикла;
	
	Возврат Сезон;

КонецФункции // ПолучитьСезон()
 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_ЗагрузкаВКамеруПропарки.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	РфпСервер.ОтразитьОстаткиВКамерахПропарки(ДополнительныеСвойства, Движения, Отказ);  
	РфпСервер.ОтразитьСтатусыПропарки(ДополнительныеСвойства, Движения, Отказ);
    //РфпСервер.ОтразитьУчетВремениПропарки(ДополнительныеСвойства, Движения, Отказ);
		
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	КонтрольЗаполнения(Отказ);
	
КонецПроцедуры


// проверка 
// - Заполненали ли камера
Процедура КонтрольЗаполнения(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
	
	// Заполненали ли камера
	
	Момент = Новый МоментВремени(НачалоЗагрузки, Ссылка); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиВКамерахПропаркиОстатки.ОбъемОстаток
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиВКамерахПропарки.Остатки(&ДатаСреза, ) КАК алк_ОстаткиВКамерахПропаркиОстатки
		|ГДЕ
		|	алк_ОстаткиВКамерахПропаркиОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка", КамераПропарки);
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(Момент, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить("Камера ГТО не пуста!");
		Отказ = Истина;
		
	КонецЦикла;   
	
	
	Если НачалоЗагрузки >= ОкончаниеЗагрузки Тогда
		
		Сообщить("Окончание загрузки должно быть позже начала загрузки!");
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если ОкончаниеЗагрузки > ВремяЗапускаКамеры Тогда
		
		Сообщить("Запуск камеры должен быть позже окончания загрузки!");
		Отказ = Истина;
		
	КонецЕсли  
	
	// контроль хронологии записей по камере - если есть более позняя запись, ее нужно отменить
	
	//ВремяПервойЗаписиСтатуса = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСтатусыПропарки[0].Период;
	
	
	
КонецПроцедуры
